{
  "backend/main.mo": "Empty Motoko actor with no logic implemented.",
  "feature_evidence.json": "Feature evidence report mapping GA4 tracking requirements to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of major frontend components, assets, and utilities.",
  "frontend/index.css": "Root Tailwind CSS theme variables and base styles for light/dark mode with OKLCH tokens.",
  "frontend/index.html": "HTML entry point with SEO metadata and dynamic GA4 script injection via environment variables.",
  "frontend/src/App.tsx": "Main application component rendering the site layout and initializing GA4 tracking utilities.",
  "frontend/src/components/BusinessHighlightsStrip.tsx": "Clickable highlight bar showing location, hours, call, and WhatsApp links with icons.",
  "frontend/src/components/MobileCareSmartUsageGuideSection.tsx": "Section listing smartphone care facts with expandable Show more/Show less toggle.",
  "frontend/src/components/SafeImage.tsx": "Image component with automatic error fallback UI and reset behavior when src changes.",
  "frontend/src/components/TickerBanner.tsx": "Displays a horizontally scrolling ticker with repeated product text.",
  "frontend/src/components/WhatsAppQuickMessages.tsx": "Provides a popover button offering preset WhatsApp messages linked to a given number.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on Internet Identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements a context and provider for managing Internet Identity authentication and state.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, and utility classes including a ticker animation.",
  "frontend/src/lib/analyticsConfig.ts": "Centralizes Google Analytics and GTM configuration using environment variables.",
  "frontend/src/lib/assetVersion.ts": "Provides a version constant and helper to append cache‑busting query strings to asset URLs.",
  "frontend/src/lib/clickTracking.ts": "Delegated click listener that tracks WhatsApp and tel link clicks via GA4 events.",
  "frontend/src/lib/ga4.ts": "Offers safe wrappers for sending GA4 events and page views, no‑oping when GA is unavailable.",
  "frontend/src/lib/googleTracking.ts": "Initializes GTM and verifies GA availability with idempotent script loading.",
  "frontend/src/lib/scrollDepthTracking.ts": "Tracks scroll depth thresholds and sends GA4 events using throttled scroll handling.",
  "frontend/src/lib/spaPageViews.ts": "Implements SPA page‑view tracking by patching history methods and listening to popstate to send GA4 page_view events.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and renders the root App component.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with plugins, custom colors, layout settings, animations, and extended theme options.",
  "project_state.json": "Defines project state and requirements for implementing GA4 tracking, enhanced measurement, and custom analytics events."
}