{
  "kind": "build_request",
  "title": "Add fixed bottom shared description section that updates from Products & Services clicks",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-51",
      "text": "In frontend/src/App.tsx, add a single shared description section at the bottom of the page that always stays at the bottom (placed as the last content section immediately before the existing Footer), and ensure only its internal content updates based on which Products & Services item is selected.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Create one single description section fixed at the bottom of the page. ... This bottom section should act as a shared information area that updates dynamically based on user interaction."
        ]
      },
      "acceptanceCriteria": [
        "A single new section exists near the bottom of the one-page layout and is placed immediately before the existing Footer in frontend/src/App.tsx.",
        "The section is always the bottom-most content area of the page (excluding the existing Footer and the existing mobile sticky action bar).",
        "No additional pages, popups, cards, or accordions are introduced for this feature.",
        "No existing global layout, fonts, colors, or styling are changed outside what is required to insert and support this section."
      ]
    },
    {
      "id": "REQ-52",
      "text": "In frontend/src/App.tsx, make each of the 5 existing Products & Services items (New Mobile Phones, Mobile Accessories, Mobile Service & Repair, Exchange & Upgrade Support, EMI / Finance Options) clickable so that clicking any item (1) smoothly scrolls the page to the bottom shared description section and (2) updates the bottom section heading + description text to match the clicked item.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "When a user clicks on any of the following items ... the page should smoothly scroll to this bottom section and update the content inside it based on the selected item."
        ]
      },
      "acceptanceCriteria": [
        "Clicking each of the 5 existing service items triggers a smooth scroll to the bottom shared description section.",
        "After the scroll, the bottom section content reflects the clicked item (correct heading and description).",
        "Only the bottom section content changes; the Products & Services grid continues to render as image + title only.",
        "No new animations are added beyond the required smooth scroll behavior."
      ]
    },
    {
      "id": "REQ-53",
      "text": "Implement the exact bottom-section content mapping (English) in frontend/src/App.tsx so the shared bottom section renders the following heading/description for each selected item exactly as provided: (1) New Mobile Phones: heading \"New Mobile Phones\"; description \"Explore the latest smartphones from top brands with warranty support. Choose from a wide range of models based on performance, camera, battery, and budget. EMI options available on eligible models.\" (2) Mobile Accessories: heading \"Mobile Accessories\"; description \"Find quality mobile accessories including chargers, cables, earphones, cases, screen guards, and power banks. Both original and high-quality compatible accessories available.\" (3) Mobile Service & Repair: heading \"Mobile Service & Repair\"; description \"Professional repair services for screen replacement, battery issues, charging port problems, speaker and mic issues, and software support. Quick diagnosis with transparent pricing and service warranty.\" (4) Exchange & Upgrade Support: heading \"Exchange & Upgrade Support\"; description \"Upgrade your old phone to a new one with easy exchange options. Get fair value for your existing device and seamless assistance during the upgrade process.\" (5) EMI / Finance Options: heading \"EMI / Finance Options\"; description \"Easy EMI and finance options available on selected mobile phones. Flexible plans with minimal documentation to make your purchase affordable.\"",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Content to display for each selection: 1. New Mobile Phones ... 5. EMI / Finance Options ..."
        ]
      },
      "acceptanceCriteria": [
        "For each of the 5 service titles, the bottom section renders the exact corresponding heading and description text as provided by the user (no paraphrasing).",
        "The correct content is shown consistently after repeated clicks across different items."
      ]
    },
    {
      "id": "REQ-54",
      "text": "In the shared bottom description section (frontend/src/App.tsx), include Call and WhatsApp buttons below the description, using the existing phoneNumber (+919840077591) and existing WhatsApp behavior (wa.me click-to-chat via the existing WhatsAppQuickMessages component) without adding any data capture, reminders, automation, or backend logic.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Include Call and WhatsApp buttons below the description"
        ]
      },
      "acceptanceCriteria": [
        "The bottom section displays a Call button that opens the dialer using tel:+919840077591.",
        "The bottom section displays a WhatsApp action that uses click-to-chat only (wa.me) with the existing WhatsApp number 919840077591.",
        "No backend changes are introduced for this feature."
      ]
    },
    {
      "id": "REQ-55",
      "text": "Ensure the new click-to-scroll behavior does not break the existing one-page structure and does not interfere with the existing mobile-only sticky bottom action bar; the bottom section must remain readable after scrolling on mobile (not obscured by the sticky action bar).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "This section must always stay at the bottom of the page"
        ]
      },
      "acceptanceCriteria": [
        "On mobile, after clicking a Products & Services item and scrolling to the bottom section, the section’s heading and description are visible and not hidden behind the existing sticky bottom action bar.",
        "The existing sticky bottom action bar (Call | WhatsApp | Map) remains present and unchanged in structure and behavior."
      ]
    }
  ],
  "constraints": [
    "Do not create new pages, popups, cards, or accordions for this feature.",
    "Do not change existing layout, fonts, colors, or styling, except what is strictly required to add the new bottom description section and click/scroll/update behavior.",
    "Keep WhatsApp integration strictly as click-to-chat (wa.me) only; do not add any data capture, reminders, automation, or backend systems.",
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui."
  ],
  "nonGoals": [
    "Adding new product/service items beyond the existing 5.",
    "Redesigning the Products & Services cards or changing them from image + title only.",
    "Adding user controls like tabs, accordions, modals, or separate detail pages.",
    "Persisting the selected item to the backend or user accounts."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}