{
  "kind": "build_request",
  "title": "Fix hero logo clipping and make logo background blend with site",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-39",
      "text": "In the Hero section of frontend/src/App.tsx, update ONLY the hero logo <img> rendering so the full logo is always clearly visible (not clipped at the top or bottom) across mobile and desktop. Ensure the logo preserves its aspect ratio and is not cropped by any sizing/overflow behavior.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Still the logo aren't clearly visible. The are cut from top and bottom ... I want logo to be clearly visible without any cutting."
        ]
      },
      "acceptanceCriteria": [
        "On common viewport sizes (mobile and desktop), the hero logo renders fully with no top/bottom clipping.",
        "The logo preserves its aspect ratio (no stretching) and is not visually cropped.",
        "No changes are made to hero headings/text, gradient overlay, slider behavior, or Call/WhatsApp buttons beyond what is necessary to fix the logo visibility."
      ]
    },
    {
      "id": "REQ-40",
      "text": "Make the hero logo image blend with the website background by using a logo asset with a transparent background (or otherwise matching the site background), and update the hero logo <img> in frontend/src/App.tsx to reference the updated static asset under frontend/public/assets/generated.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "... even BG of logo is not merged with website BG."
        ]
      },
      "acceptanceCriteria": [
        "The hero logo background visually blends with the page/hero background (no visible solid background box behind the logo).",
        "The updated logo file is served as a static asset from frontend/public/assets/generated and referenced by the hero logo <img> in frontend/src/App.tsx.",
        "No other sections or assets are modified beyond what is required to update the hero logo asset reference."
      ]
    }
  ],
  "constraints": [
    "Do not modify any other page sections or content beyond what is required to fix the hero logo visibility/background blending.",
    "Keep the hero overlay content (logo placement, headings, gradient overlay, Call/WhatsApp buttons) functionally the same; only adjust what is necessary to prevent clipping and to blend the logo background.",
    "Do not add any new sections, promotional content, or animations beyond the existing hero fade slider."
  ],
  "nonGoals": [
    "Redesigning the hero section layout or changing the hero text.",
    "Changing the hero slider timing, adding controls (arrows/dots), or adding new animations.",
    "Changing WhatsApp/Call/Map behavior or links."
  ],
  "imageRequirements": {
    "required": [],
    "edits": [
      "Remove solid background and add safe padding so the logo cannot appear visually clipped (Gadget Zone-Logo-1.png > gadget-zone-logo-transparent-padded.dim_1000x400.png)"
    ]
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}