{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Enable GA4 via gtag.js with hardcoded measurement ID G-HBEHE5MY5Y",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Load and configure GA4 gtag.js in production using measurement ID G-HBEHE5MY5Y without env placeholders, while keeping existing SPA tracking working via window.gtag.",
      "acceptanceCriteria": [
        "In the built app HTML head, the gtag.js script is loaded from https://www.googletagmanager.com/gtag/js?id=G-HBEHE5MY5Y.",
        "On initial page load, window.dataLayer is initialized and gtag('config','G-HBEHE5MY5Y') is called.",
        "Existing GA4 helper code (e.g., SPA page views and click tracking) continues to function by finding window.gtag defined at runtime.",
        "No user-facing text is changed as part of this tracking addition."
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Replace the current conditional GA4 loader (which uses %VITE_GA_MEASUREMENT_ID%) with the explicit GA4 gtag.js snippet that loads https://www.googletagmanager.com/gtag/js?id=G-HBEHE5MY5Y and calls gtag('config','G-HBEHE5MY5Y') on initial load; ensure window.dataLayer is initialized and window.gtag is assigned so existing runtime tracking helpers can use it."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Make GA4 initialization deterministic and consistent across index.html and frontend tracking modules, avoiding duplicate or contradictory GA setup.",
      "acceptanceCriteria": [
        "There is a single, deterministic GA4 initialization flow (no double-injection of GA scripts and no conflicting measurement IDs).",
        "The app does not throw runtime errors in console related to gtag/dataLayer initialization when loading the homepage and navigating within the SPA."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/analyticsConfig.ts",
          "operation": "modify",
          "description": "Update the GA configuration to be consistent with the hardcoded measurement ID G-HBEHE5MY5Y (and not depend on VITE_GA_MEASUREMENT_ID), so modules like ga4.ts determine availability consistently with the index.html initialization."
        },
        {
          "path": "frontend/src/lib/googleTracking.ts",
          "operation": "modify",
          "description": "Ensure GA initialization logic cannot cause a second or conflicting GA setup path (keep GA as head-loaded only, and make initializeGA a verification/no-op that will not inject scripts or reconfigure with a different measurement ID)."
        }
      ]
    }
  ]
}